УНФ_ТЕСТ/src/AccumulationRegisters/СтраховыеВзносыДоходы/СтраховыеВзносыДоходы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>СтраховыеВзносыДоходы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Скидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДохода</name>
    <type>
      <types>CatalogRef.ВидыДоходовПоСтраховымВзносам</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

УНФ_ТЕСТ/src/AccumulationRegisters/СтраховыеВзносыДоходы/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура создает пустую временную таблицу изменения движений.
//
Процедура СоздатьПустуюВременнуюТаблицуИзменение(ДополнительныеСвойства) Экспорт
	
	Если НЕ ДополнительныеСвойства.Свойство("ДляПроведения")
	 ИЛИ НЕ ДополнительныеСвойства.ДляПроведения.Свойство("СтруктураВременныеТаблицы") Тогда	
		Возврат;		
	КонецЕсли;
	
	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 0
	|	СтраховыеВзносыДоходы.НомерСтроки КАК НомерСтроки,
	|	СтраховыеВзносыДоходы.Организация КАК Организация,
	|	СтраховыеВзносыДоходы.Сотрудник КАК Сотрудник,
	|	СтраховыеВзносыДоходы.ВидДохода КАК ВидДохода,
	|	СтраховыеВзносыДоходы.Сумма КАК СуммаПередЗаписью,
	|	СтраховыеВзносыДоходы.Сумма КАК СуммаИзменение,
	|	СтраховыеВзносыДоходы.Сумма КАК СуммаПриЗаписи,
	|	СтраховыеВзносыДоходы.Скидка КАК СкидкаПередЗаписью,
	|	СтраховыеВзносыДоходы.Скидка КАК СкидкаИзменение,
	|	СтраховыеВзносыДоходы.Скидка КАК СкидкаПриЗаписи
	|ПОМЕСТИТЬ ДвиженияСтраховыеВзносыДоходыИзменение
	|ИЗ
	|	РегистрНакопления.СтраховыеВзносыДоходы КАК СтраховыеВзносыДоходы");
	
	Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураВременныеТаблицы.Вставить("ДвиженияСтраховыеВзносыДоходыИзменение", Ложь);
	
КонецПроцедуры // СоздатьПустуюВременнуюТаблицуИзменение()

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#КонецЕсли
